# Tugas Individu Teknologi Basis Data
- Nama: Muhammad Haerul
- NIM: H071201033
- Kelas: A

## Create Engine

In [1]:
from sqlalchemy import create_engine
engine = create_engine('mysql://root@localhost/classicmodels', echo=False)

from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()
Base.metadata.create_all(engine)

from sqlalchemy.orm import sessionmaker
Session = sessionmaker(bind = engine)
session = Session()

## Create Models

In [2]:
from sqlalchemy import Column, DECIMAL, Date, ForeignKey, String, Text
from sqlalchemy.dialects.mysql import INTEGER, MEDIUMBLOB, MEDIUMTEXT, SMALLINT
from sqlalchemy.orm import relationship
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()
metadata = Base.metadata

class Office(Base):
    __tablename__ = 'offices'

    officeCode = Column(String(10), primary_key=True)
    city = Column(String(50), nullable=False)
    phone = Column(String(50), nullable=False)
    addressLine1 = Column(String(50), nullable=False)
    addressLine2 = Column(String(50))
    state = Column(String(50))
    country = Column(String(50), nullable=False)
    postalCode = Column(String(15), nullable=False)
    territory = Column(String(10), nullable=False)


class Productline(Base):
    __tablename__ = 'productlines'

    productLine = Column(String(50), primary_key=True)
    textDescription = Column(String(4000))
    htmlDescription = Column(MEDIUMTEXT)
    image = Column(MEDIUMBLOB)


class Employee(Base):
    __tablename__ = 'employees'

    employeeNumber = Column(INTEGER(11), primary_key=True)
    lastName = Column(String(50), nullable=False)
    firstName = Column(String(50), nullable=False)
    extension = Column(String(10), nullable=False)
    email = Column(String(100), nullable=False)
    officeCode = Column(ForeignKey('offices.officeCode'), nullable=False, index=True)
    reportsTo = Column(ForeignKey('employees.employeeNumber'), index=True)
    jobTitle = Column(String(50), nullable=False)

    office = relationship('Office')
    parent = relationship('Employee', remote_side=[employeeNumber])


class Product(Base):
    __tablename__ = 'products'

    productCode = Column(String(15), primary_key=True)
    productName = Column(String(70), nullable=False)
    productLine = Column(ForeignKey('productlines.productLine'), nullable=False, index=True)
    productScale = Column(String(10), nullable=False)
    productVendor = Column(String(50), nullable=False)
    productDescription = Column(Text, nullable=False)
    quantityInStock = Column(SMALLINT(6), nullable=False)
    buyPrice = Column(DECIMAL(10, 2), nullable=False)
    MSRP = Column(DECIMAL(10, 2), nullable=False)

    productline = relationship('Productline')


class Customer(Base):
    __tablename__ = 'customers'

    customerNumber = Column(INTEGER(11), primary_key=True)
    customerName = Column(String(50), nullable=False)
    contactLastName = Column(String(50), nullable=False)
    contactFirstName = Column(String(50), nullable=False)
    phone = Column(String(50), nullable=False)
    addressLine1 = Column(String(50), nullable=False)
    addressLine2 = Column(String(50))
    city = Column(String(50), nullable=False)
    state = Column(String(50))
    postalCode = Column(String(15))
    country = Column(String(50), nullable=False)
    salesRepEmployeeNumber = Column(ForeignKey('employees.employeeNumber'), index=True)
    creditLimit = Column(DECIMAL(10, 2))

    employee = relationship('Employee')


class Order(Base):
    __tablename__ = 'orders'

    orderNumber = Column(INTEGER(11), primary_key=True)
    orderDate = Column(Date, nullable=False)
    requiredDate = Column(Date, nullable=False)
    shippedDate = Column(Date)
    status = Column(String(15), nullable=False)
    comments = Column(Text)
    customerNumber = Column(ForeignKey('customers.customerNumber'), nullable=False, index=True)

    customer = relationship('Customer')


class Payment(Base):
    __tablename__ = 'payments'

    customerNumber = Column(ForeignKey('customers.customerNumber'), primary_key=True, nullable=False)
    checkNumber = Column(String(50), primary_key=True, nullable=False)
    paymentDate = Column(Date, nullable=False)
    amount = Column(DECIMAL(10, 2), nullable=False)

    customer = relationship('Customer')


class Orderdetail(Base):
    __tablename__ = 'orderdetails'

    orderNumber = Column(ForeignKey('orders.orderNumber'), primary_key=True, nullable=False)
    productCode = Column(ForeignKey('products.productCode'), primary_key=True, nullable=False, index=True)
    quantityOrdered = Column(INTEGER(11), nullable=False)
    priceEach = Column(DECIMAL(10, 2), nullable=False)
    orderLineNumber = Column(SMALLINT(6), nullable=False)

    order = relationship('Order')
    product = relationship('Product')

## Define and Import Helper Functions

In [10]:
import pandas as pd
from sqlalchemy.sql import func
from sqlalchemy import or_

def to_df_dict(query):
    return pd.DataFrame([i.__dict__ for i in query]).drop(columns='_sa_instance_state')

def to_df(query):
    df = pd.read_sql(query.statement, engine)
    return df

## Questions

### 1. Prepare a list of offices sorted by country, state, city.

In [4]:
o = Office
num1 = session.query(o.officeCode, o.country, o.state, o.city).order_by(Office.country, Office.state, Office.city)

df1 = to_df(num1)
df1.style.hide(axis='index')

### 2. How many employees are there in the company?

In [174]:
num2 = session.query(Employee).count()
print('Number of employee =', num2)

Number of employee = 23

### 3. What is the total of payments received?

In [7]:
num3 = session.query(func.sum(Payment.amount)).scalar()
print('Total payment =', num3)

Total payment = 8853839.23

### 4. List the product lines that contain 'Cars'

In [182]:
num4 = session.query(Productline).filter(Productline.productLine.contains('Cars'))

df4 = to_df(num4)
df4.style.hide(axis='index')

### 5. Report total payments for October 28, 2004.

In [177]:
num5 = session.query(func.sum(Payment.amount)).filter(Payment.paymentDate.contains("2004-10-28")).scalar()
print(f"Total Payments for October 28, 2004 is ${num5}")

Total Payments for October 28, 2004 is $47411.33

### 6. Report those payments greater than $100,000.

In [183]:
num6 = session.query(Payment).filter(Payment.amount > 100000)

df6 = to_df(num6)
df6.style.hide(axis='index')

### 7. List the products in each product line.

In [184]:
num7 = session.query(Product, func.group_concat(Product.productName)).group_by(Product.productLine)

df7 = to_df(num7).rename(columns={'group_concat_1':'listProduct'})
df7[['productLine', 'listProduct']].style.hide(axis='index')

### 8. How many products in each product line?

In [185]:
num8 = session.query(Product.productLine, func.count(Product.productCode)).group_by(Product.productLine)

df8 = to_df(num8).rename(columns={'count_1':'countProduct'})
df8.style.hide(axis='index')

### 9. What is the minimum payment received?

In [157]:
num9 = session.query(func.min(Payment.amount)).scalar()
print('Minimum payment =', num9)

Minimum payment = 615.45

### 10. List all payments greater than twice the average payment.

In [186]:
avg_payment = session.query(func.avg(Payment.amount)).scalar()
num10 = session.query(Payment).filter(Payment.amount >= avg_payment*2)

df10 = to_df(num10)
df10.style.hide(axis='index')

### 11. What is the average percentage markup of the MSRP on buyPrice?

In [187]:
a = Product.buyPrice
b = Product.MSRP
num11 = session.query(func.avg((b-a)/a)*100).scalar()
print(f"Average percentage markup of the MSRP on buyPrice is {num11}%")

Average percentage markup of the MSRP on buyPrice is 88.7023921713%

### 12. How many distinct products does ClassicModels sell?

In [160]:
num12 = session.query(Product).distinct().count()
print(f"Distinct products: {num12}")

Distinct products: 110

### 13. Report the name and city of customers who don't have sales representatives?

In [188]:
num13 = session.query(Customer).filter(Customer.salesRepEmployeeNumber == None)

df13 = to_df(num13).rename(columns={'salesRepEmployeeNumber':'salesRepresentatives'})
df13[["customerName", "city", 'salesRepresentatives']].style.hide(axis='index')

### 14. What are the names of executives with VP or Manager in their title? Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.

In [18]:
num14 = session.query(Employee.employeeNumber, 
                      func.concat(Employee.firstName, " ", Employee.lastName), 
                      Employee.jobTitle).filter(or_(Employee.jobTitle.contains('VP') , 
                                                    Employee.jobTitle.contains('Manager')))

df14 = to_df(num14).rename(columns={'concat_1':'full_name'})
df14.style.hide(axis='index')

### 15. Which orders have a value greater than $5,000?

In [17]:
num15 = session.query(Orderdetail.orderNumber, func.concat("$", Orderdetail.priceEach), 
                      Orderdetail.quantityOrdered, 
                      func.concat("$", Orderdetail.priceEach * Orderdetail.quantityOrdered)).filter(Orderdetail.priceEach * Orderdetail.quantityOrdered > 5000)

df15 = to_df(num15).rename(columns={'concat_3':'Value'})
df15

     orderNumber concat_1  quantityOrdered      Value
0          10103  $214.30               26   $5571.80
1          10103  $119.67               42   $5026.14
2          10105  $127.84               50   $6392.00
3          10105  $205.72               41   $8434.52
4          10105  $117.97               43   $5072.71
..           ...      ...              ...        ...
405        10421  $167.06               35   $5847.10
406        10424  $201.44               50  $10072.00
407        10424  $121.64               49   $5960.36
408        10424  $108.50               54   $5859.00
409        10425  $127.79               49   $6261.71

[410 rows x 4 columns]